app/views/contracts/_referent_field.erb

SELECT  "referents".* FROM "referents" WHERE "referents"."contract_id" = ? LIMIT 1  [["contract_id", 46]]
---
<%= f.label 'Ruolo' %>
<%= f.select :role, Referent::VALID_ROLES %><br>