app/controllers/blocks_controller.rb

SELECT "blocks".* FROM "blocks"
---
  def index
    @blocks = Block.all

INSERT INTO "blocks" ("tipo", "attivazione", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tipo", ""], ["attivazione", "2015-05-22"], ["created_at", "2015-05-22 13:32:04.618824"], ["updated_at", "2015-05-22 13:32:04.618824"]]
---
  def create
    @block = Block.new(block_params)

    respond_to do |format|
      if @block.save

DELETE FROM "blocks" WHERE "blocks"."id" = ?  [["id", 1]]
---
  def destroy
    @block.destroy

SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_block
      @block = Block.find(params[:id])