app/controllers/companies_controller.rb

INSERT INTO "companies" ("ragione_sociale", "piva", "phone_number", "fax", "mail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save