app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
  def index
    @contracts = Contract.all

SELECT  "companies".* FROM "companies" WHERE "companies"."contract_id" = ? LIMIT 1  [["contract_id", 31]]
SELECT  "heads".* FROM "heads" WHERE "heads"."company_id" = ? LIMIT 1  [["company_id", 10]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "referents".* FROM "referents" WHERE "referents"."contract_id" = ? LIMIT 1  [["contract_id", 44]]
---
  def show
    @company = Company.find_by_contract_id(@contract.id)
    @head = Head.find_by_company_id(@company.id)
    @company_address = Address.find_by_id(@company.address_id)
    @head_address = Address.find_by_id(@head.address_id)
    @referent = Referent.find_by_contract_id(@contract.id)

INSERT INTO "contracts" ("company_id", "referent_id", "data", "activation_data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company_id", 5], ["referent_id", 6], ["data", "2015-04-17"], ["activation_data", "2015-04-17"], ["created_at", "2015-04-17 15:18:37.052677"], ["updated_at", "2015-04-17 15:18:37.052677"]]
---
  def create
    @contract = Contract.new(contract_params)

    respond_to do |format|
      if @contract.save

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = NULL LIMIT 1
---
  def addservices
    @contract = Contract.find(params[:id])

UPDATE "contracts" SET "data" = ?, "updated_at" = ? WHERE "contracts"."id" = ?  [["data", "2015-06-07"], ["updated_at", "2015-05-29 15:39:48.845559"], ["id", 46]]
---
  def update
    respond_to do |format|
      if @contract.update(contract_params)

DELETE FROM "contracts" WHERE "contracts"."id" = ?  [["id", 1]]
---
  def destroy
    @contract.destroy

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", 44]]
---
  def set_contract
    @contract = Contract.find(params[:id])