app/controllers/heads_controller.rb

SELECT "heads".* FROM "heads"
---
  def index
    @heads = Head.all