app/controllers/referents_controller.rb

  def index
    @referents = Referent.all
---
SELECT "referents".* FROM "referents"