app/controllers/services_controller.rb

INSERT INTO "services" ("tipo", "contract_id", "attivazione", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tipo", ""], ["contract_id", 46], ["attivazione", "2015-05-28"], ["created_at", "2015-05-28 12:58:14.050622"], ["updated_at", "2015-05-28 12:58:14.050622"]]
---
  def create
    @service = Service.new(service_params)

    respond_to do |format|
        if @service.save

DELETE FROM "services" WHERE "services"."id" = ?  [["id", 2]]
---
  def destroy
    @service.destroy